# **Pandas 2회차**

In [1]:
import pandas as pd
import numpy as np

# SELECT in DataFrame

* **loc[줄,칸]** : 값 으로 꺼내기
* **iloc[줄,칸]** : index로 꺼내기

* [줄,칸]에 들어갈 수 있는 값
    - 단일값
    - [단일값,단일값,단일값]
    - 슬라이싱[ : ]

## SELECT vs SQL

In [2]:
emp = pd.read_csv("./lec08_emp.csv", parse_dates=['HIREDATE'])
emp.head(3)

   EMPNO  ENAME       JOB     MGR   HIREDATE   SAL   COMM  DEPTNO
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

In [3]:
emp.columns.str.lower() #컬럼값 뽑아서 소문자로 바꿔라. 먼저 글자형으로 바꾸고
emp.columns = emp.columns.str.lower() #그리고 메모리상이 아닌 변수로 재정의 해줘라

### **select**
    - select * from emp;

**기본 문법**

* df [단일 컬럼]
* df [ [컬럼1], [컬럼2] ]
* df [ 조건 ]

In [4]:
emp.head(3) #just dataframe 명을 조회

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

### **컬럼값 select**
    - select ename from emp; - 컬럼값 출력

In [5]:
emp['ename'] # ename만 출력해라

0      SMITH
1      ALLEN
2       WARD
3      JONES
4     MARTIN
5      BLAKE
6        CCC
7      SCOTT
8       KING
9     TURNER
10     ADAMS
11     JAMES
12      FORD
13    MILLER
Name: ename, dtype: object

---

### **복수 컬럼값 select**

    -select ename, empno from emp;

In [6]:
emp[['ename','empno']].head(3) #떼거지는 []로 묶는다. df명[['...','...']]

   ename  empno
0  SMITH   7369
1  ALLEN   7499
2   WARD   7521

***

## loc 와 iloc

* **loc[줄,칸]** : 값 으로 꺼내기 ★★ 주의 : 이상, 미만
* **iloc[줄,칸]** : index로 꺼내기 ★★ 주의 : 이상, 이하

* [줄,칸]에 들어갈 수 있는 값
    - df.iloc[단일값]
    - df.iloc[단일값,단일값,단일값]
    - df.iloc[ : ] 슬라이싱

### **iloc 예제**

In [7]:
emp.iloc[0] 

#한 줄만 가져오기(한 줄은 리턴타입이 시리즈 데이터)
#줄 단일값

empno                      7369
ename                     SMITH
job                       CLERK
mgr                      7902.0
hiredate    1980-12-17 00:00:00
sal                         800
comm                        NaN
deptno                       20
Name: 0, dtype: object

In [8]:
emp.iloc[ [0,1] ] 

#2줄 가져오기(2줄은 리턴타입이 데이터프레임)
#줄 [단일값, 단일값]

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30

In [9]:
emp.iloc[ [0,3,5] ] 

#3줄 가져오기 (줄(행=값)에 대해서만 가져와)
#줄 [단일값, 단일값, 단일값]

   empno  ename      job     mgr   hiredate   sal  comm  deptno
0   7369  SMITH    CLERK  7902.0 1980-12-17   800   NaN      20
3   7566  JONES  MANAGER  7839.0 1981-04-02  2975   NaN      20
5   7698  BLAKE  MANAGER  7839.0 1981-05-01  2850   NaN      30

>**칸 가져오기**

In [10]:
emp.iloc[0 , 0]

#0(1)번째 행의 0(1)열 가져와 / 줄 단일값, 칸 단일값

7369

In [11]:
emp.iloc[0 , [0,1]]

# 0번째 행에서 0,1열 가져와 / 줄 단일값, 칸 복수값

empno     7369
ename    SMITH
Name: 0, dtype: object

In [12]:
emp.iloc[[0,1,2] , [0,1]]

# 0,1,2번 행에서 0,1열 가져와 / 줄 복수값, 칸 복수값

   empno  ename
0   7369  SMITH
1   7499  ALLEN
2   7521   WARD

>**슬라이싱**

In [13]:
# emp.iloc[ 줄, 칸 ]
emp.iloc[ 0 : 3 ] #줄에 대해 슬라이싱

   empno  ename       job     mgr   hiredate   sal   comm  deptno
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30

In [14]:
emp.iloc[ 0 : 3 , 1 : 4] #줄 슬라이싱, 칸 슬라이싱

   ename       job     mgr
0  SMITH     CLERK  7902.0
1  ALLEN  SALESMAN  7698.0
2   WARD  SALESMAN  7698.0

In [15]:
emp.iloc[ [0,2,5] , 1 : 4] #줄 [단일값,단일값,단일값], 칸 슬라이싱

   ename       job     mgr
0  SMITH     CLERK  7902.0
2   WARD  SALESMAN  7698.0
5  BLAKE   MANAGER  7839.0

***

***

### **loc 예제**

**★★★    loc은 값에 의한 접근    ★★★**

>df.loc[줄의 값, 칸의 값] : 이 때의 줄의 값이라는 것은 인덱스의 값이다.

In [16]:
print(emp)
emp.loc[[1,2,3],'empno'] #1,2,3 인덱스의 empno 값을 가져와라

    empno   ename        job     mgr   hiredate   sal    comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1987-07-13  3000     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0 1987-07-13  1100     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10

1    7499
2    7521
3    7566
Name: empno, dtype: int64

In [17]:
emp.loc[[1,2,3],['empno','ename']] #1,2,3 인덱스의 empno,ename 값을 가져와라

   empno  ename
1   7499  ALLEN
2   7521   WARD
3   7566  JONES

**★★★ loc으로 슬라이싱 시, 미만이 아니다. 주의 ★★★**  
**★★★ loc과 iloc은 혼용 불가이다. ★★★**

In [18]:
emp.loc[0:3, 'empno':'mgr'] #값은 미만이 아니라 포함이다. 0,1,2,3 인덱스의 empno부터 mgr까지 불러줘.

   empno  ename       job     mgr
0   7369  SMITH     CLERK  7902.0
1   7499  ALLEN  SALESMAN  7698.0
2   7521   WARD  SALESMAN  7698.0
3   7566  JONES   MANAGER  7839.0

In [19]:
#예제

emp.loc[1:4,'job':'hiredate']
# emp.iloc[1:5, 2:5] iloc은 인덱스이기 때문에 무조건 숫자로만. loc은 값이기 때문에 값도 슬라이싱 할 수 있는 것.

        job     mgr   hiredate
1  SALESMAN  7698.0 1981-02-20
2  SALESMAN  7698.0 1981-02-22
3   MANAGER  7839.0 1981-04-02
4  SALESMAN  7698.0 1981-09-28

***

## where 조건
    - df [조건부] ★★★★★★★★★★★★
    - df [조건부][컬럼명] : 조건을 만족하는 컬럼
    - df [컬럼명][조건부] : 조건, 컬럼 순서 바뀌어도 상관없다.
    - 항상 df[조건][컬럼] 이 수식을 만들어놓고 코딩을 해라. 안그러면 햇갈림

### 기본예제

>select * from emp where deptno = 10;

In [20]:
emp[emp['deptno']==10] # '='한개만 쓰면 수정이 된다. 유의

    empno   ename        job     mgr   hiredate   sal  comm  deptno
6    7782     CCC    MANAGER  7839.0 1981-06-09  2450   NaN      10
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000   NaN      10
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300   NaN      10

> select empno, ename from emp where deptno = 10;

In [21]:
emp[emp['deptno']==10][['empno','ename']] #조건과 컬럼을 *(조합)해주면 된다. 순서는 상관없다. 
emp[['empno','ename']][emp['deptno']==10]

    empno   ename
6    7782     CCC
8    7839    KING
13   7934  MILLER

### 조건이 2개일 때

* 멀티 조건은 반드시 (     )를 써야한다.
* and  : &
* or  : |
* df[컬럼][(조건) & (조건) | (조건)]
* df[컬럼][(조건) & ( (조건) | (조건) )] 식으로 괄호로 조건 순서 지정도 가능(괄호 안부터 처리)
* 반드시 모든 조건을 괄호로 묶어라 df[(df['컬럼']==10)&(df['컬럼2']=='A')]

>select empno, ename, sal from emp where deptno = 10 and sal > 2000;

In [22]:
#df[(조건) & (조건) ][['컬럼','컬럼']]

emp[(emp['deptno']==10) & (emp['sal']>2000)][['empno','ename','sal']]

   empno ename   sal
6   7782   CCC  2450
8   7839  KING  5000

# subquery (비추)

#sql

    *select job from emp where empno = 7369; 
        -사번이 7369인 사원의 직업 출력

    *select ename, job
        -from emp 
        where job = (select job
        from emp where empno = 7369); 서브쿼리
        사번이 7369인 사원과 직업이 같은 직원들의 이름과 직업 출력

In [23]:
emp[emp['empno']==7369]['job']

0    CLERK
Name: job, dtype: object

In [24]:
job7369=emp[emp['empno']==7369]['job'].values[0] #0번째 값만 뽑아라(인덱스 빼고)
job7369

'CLERK'

In [25]:
#select ename, job from emp where job = (select job from emp where empno = 7369);

emp[['ename','job']][emp['job']==job7369]

     ename    job
0    SMITH  CLERK
10   ADAMS  CLERK
11   JAMES  CLERK
13  MILLER  CLERK

>select job from emp where deptno = 10 group by job;
>- 10번 부서 사람들의 직업들

In [26]:
job10 = emp['job'][emp['deptno']==10].values #values로 값을 뽑아줘야 [ , , , ..] 등의 객체 값으로 뽑아낼 수 있다.

job10

array(['MANAGER', 'PRESIDENT', 'CLERK'], dtype=object)

In [27]:
# emp[['job','ename']]
emp['job'].isin(job10) #emp데이터프레임의 'job'컬럼 중에서 job10의 값을 포함한 데이터가 있는가?

0      True
1     False
2     False
3      True
4     False
5      True
6      True
7     False
8      True
9     False
10     True
11     True
12    False
13     True
Name: job, dtype: bool

In [28]:
emp[['ename','job']][emp['job'].isin(job10)].head(3)

   ename      job
0  SMITH    CLERK
3  JONES  MANAGER
5  BLAKE  MANAGER

## **문자열 합치기**

>select job || ename from emp;

>select concat(job,ename) from emp;

In [29]:
emp['job'] + emp['ename']

0         CLERKSMITH
1      SALESMANALLEN
2       SALESMANWARD
3       MANAGERJONES
4     SALESMANMARTIN
5       MANAGERBLAKE
6         MANAGERCCC
7       ANALYSTSCOTT
8      PRESIDENTKING
9     SALESMANTURNER
10        CLERKADAMS
11        CLERKJAMES
12       ANALYSTFORD
13       CLERKMILLER
dtype: object

## 컬럼 연산하기(=연산한 컬럼 추가하기)

>**select sal*12 asal from emp;  #데이터 프레임에서도 컬럼연산 가능한가?**

In [30]:
emp['sal']*12 # 값은 나오지만 변수 정의 하지 않아서 데이터상에만 있음
emp['asal'] = emp['sal']*12 # emp의 asal 이라는 컬럼에 해당 값을 넣어주세요.
emp['asal'].head(3)

0     9600
1    19200
2    15000
Name: asal, dtype: int64

In [31]:
emp.head(3)

   empno  ename       job     mgr   hiredate   sal   comm  deptno   asal
0   7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN      20   9600
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0      30  19200
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  500.0      30  15000

>emp['job'] + emp['sal'] # 타입이 다른 컬럼은 연산이 되지 않는다.

# 결측처리
    
    - df.dropna()
    - df.fillna() 
        - emp['comm'].fillna(0) = nvl(comm,0)
    - df.isna()
        - emp['comm'].isna() = where comm is null;

>select nvl(comm,0) from emp;

In [32]:
emp.isna().head(3)

   empno  ename    job    mgr  hiredate    sal   comm  deptno   asal
0  False  False  False  False     False  False   True   False  False
1  False  False  False  False     False  False  False   False  False
2  False  False  False  False     False  False  False   False  False

In [33]:
n = emp['comm'].fillna(0).astype('int')
n

0        0
1      300
2      500
3        0
4     1400
5        0
6        0
7        0
8        0
9        0
10       0
11       0
12       0
13       0
Name: comm, dtype: int32

In [34]:
emp['comm2']= emp['comm'].fillna(0) #comm2라는 컬럼을 comm에 결측이 있다면 0으로 채워서 만들어줘라
emp[['comm','comm2']].head(3)

    comm  comm2
0    NaN    0.0
1  300.0  300.0
2  500.0  500.0

---

---

# Groupby 함수

* df.groupby( '컬럼' )[ '컬럼' ] . 함수()

* 그룹함수 종류
    - mean(),max(),min(),count(), sum() std()

> select deptno, count(empno) from emp group by deptno;

In [35]:
gemp = emp.groupby("deptno") #부서로 그룹화해라
print(gemp)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E1EFFBC970>

In [36]:
emp.groupby("deptno").first() #그룹별 첫번째 행 가져오기

        empno  ename       job     mgr   hiredate   sal   comm   asal  comm2
deptno
10       7782    CCC   MANAGER  7839.0 1981-06-09  2450    NaN  29400    0.0
20       7369  SMITH     CLERK  7902.0 1980-12-17   800    NaN   9600    0.0
30       7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  300.0  19200  300.0

In [37]:
emp.groupby("deptno")['deptno'].count()

deptno
10    3
20    5
30    6
Name: deptno, dtype: int64

## 각 부서별 급여 합

    - select deptno, sum(sal) from emp group by deptno;

In [38]:
emp.groupby("deptno")['deptno'].sum()

deptno
10     30
20    100
30    180
Name: deptno, dtype: int64

## 부서별 최대 , 최소 급여

In [39]:
maxsal = emp.groupby("deptno")['sal'].max()
maxsal

deptno
10    5000
20    3000
30    2850
Name: sal, dtype: int64

In [40]:
minsal = emp.groupby("deptno")['sal'].min()
minsal

deptno
10    1300
20     800
30     950
Name: sal, dtype: int64

***

> 단일 컬럼의 함수값을 동시 출력할 수 있을까? = 안된다. 

> 컬럼이 상이할 때는 다양한 함수값 출력에 단순한 딕셔너리값도 가능.

In [41]:
#max와 min 동시에 출력

emp.groupby("deptno").agg({"sal":"max", "comm":"min"})

         sal  comm
deptno
10      5000   NaN
20      3000   NaN
30      2850   0.0

In [42]:
emp.groupby("deptno").agg({"sal":"max", "sal":"min"}) 

#딕트에 같은 키 값을 써서 제대로 출력되지 않는다.

         sal
deptno
10      1300
20       800
30       950

## 단일 컬럼의 복수 값 출력하는 법

> * dict 안에 sal 키 값이 중복되면 에러(제대로 출력이 되지 않는다.)  
    그렇기 때문에, 키 값(컬럼)이 하나일 때는 agg를 이용해 함수를 나열해서 합쳐준다.
* **df . groupby ("그룹화 할 컬럼명") ['출력할 값 컬럼명'] . agg ( ['그룹함수이름1' , '그룹함수이름2' , ...] )**
* 파이썬은 '', "" 구분 안함

In [43]:
emp.groupby("deptno")['sal'].agg(['max','min']) 
#부서로 그룹화 된 sal 컬럼을 agg 해줘라. max와 min 값을

         max   min
deptno
10      5000  1300
20      3000   800
30      2850   950

#예제 : 각 부서별 급여 합, 최대, 최소, 평균, 카운트

In [44]:
emp.groupby('deptno')['sal'].agg(['sum','max','min','mean','count']) #어그리게이션 : 묶어줘라

          sum   max   min         mean  count
deptno
10       8750  5000  1300  2916.666667      3
20      10875  3000   800  2175.000000      5
30       9400  2850   950  1566.666667      6

In [45]:
emp.groupby('deptno')['sal'].agg(['sum','max','min','mean','count', 'std','var']) #표준편차, 분산

          sum   max   min         mean  count          std           var
deptno
10       8750  5000  1300  2916.666667      3  1893.629672  3.585833e+06
20      10875  3000   800  2175.000000      5  1123.332097  1.261875e+06
30       9400  2850   950  1566.666667      6   668.331255  4.466667e+05

# orderby 정렬 :  SORT

> sort_value  

> sort_index

* **데이터 프레임에서 꺼내진 컬럼에 대해서만 정렬이 가능**  
    
    -꺼내지도 않은 데이터는 쓸 수가 없다.
    - emp[['empno','sal']].sort_values(by='sal') 가능
    - emp[['empno','sal']].sort_values(by='job') 불가능

##  sort_values()

In [46]:
emp['sal'].sort_values()

0      800
11     950
10    1100
2     1250
4     1250
13    1300
9     1500
1     1600
6     2450
5     2850
3     2975
7     3000
12    3000
8     5000
Name: sal, dtype: int64

> select sal from emp orderby asc;

In [47]:
emp['sal'].sort_values(ascending =  True)
emp['sal'].sort_values(ascending =  False) #desc는 없다.

8     5000
7     3000
12    3000
3     2975
5     2850
6     2450
1     1600
9     1500
13    1300
2     1250
4     1250
10    1100
11     950
0      800
Name: sal, dtype: int64

> select empno, ename, sal from emp where deptno = 20 order by ename asc;

In [48]:
emp[['empno','ename','sal']][emp['deptno'] == 20].sort_values(by='ename', ascending = True) 

#by는 써도 그만 안써도 그만이지만 특정 기준으로 정렬하라고 하면 써줘야한다.

    empno  ename   sal
10   7876  ADAMS  1100
12   7902   FORD  3000
3    7566  JONES  2975
7    7788  SCOTT  3000
0    7369  SMITH   800

> select empno, ename, sal from emp order by deptno asc, sal desc;

In [49]:
#둘다 asc 인 경우
emp[['empno', 'deptno', 'sal']].sort_values(by=["deptno","sal"],ascending=True).head()

    empno  deptno   sal
13   7934      10  1300
6    7782      10  2450
8    7839      10  5000
0    7369      20   800
10   7876      20  1100

In [50]:
emp[['empno','deptno','sal']].sort_values( by=["deptno","sal"], ascending = True).head(3)

# 둘 다 asc일 때는 떼거지 가능

    empno  deptno   sal
13   7934      10  1300
6    7782      10  2450
8    7839      10  5000

In [51]:
emp[['empno','deptno','sal']].sort_values( by=["deptno","sal"], ascending = [True,False]).head(3) 

# 정렬방법도 떼거지 가능

    empno  deptno   sal
8    7839      10  5000
6    7782      10  2450
13   7934      10  1300

## sort_index()

In [52]:
emp.sort_index(ascending = False).head(3)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2
13,7934,MILLER,CLERK,7782.0,1982-01-23,1300,NaN,10,15600,0.0
12,7902,FORD,ANALYST,7566.0,1981-12-03,3000,NaN,20,36000,0.0
11,7900,JAMES,CLERK,7698.0,1981-12-03,950,NaN,30,11400,0.0

***

# Update

## **기본 문법**

    *df[기존컬럼] = 값    :   값 수정
    *df[신규컬럼] = 값    :   신규 컬럼 생성

In [53]:
emp['comm'] = 9999 #comm 컬럼 9999로 수정해라. 데이터 프레임에 있는 기존 컬럼에 값을 입력하면 수정이 된다.
emp.head(3)

   empno  ename       job     mgr   hiredate   sal  comm  deptno   asal  comm2
0   7369  SMITH     CLERK  7902.0 1980-12-17   800  9999      20   9600    0.0
1   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600  9999      30  19200  300.0
2   7521   WARD  SALESMAN  7698.0 1981-02-22  1250  9999      30  15000  500.0

## df.at 문법 (단일값 수정)

    * df.at[줄, 칸] = 변경값
    * df.iat[줄idx, 칸idx] = 변경값  , idx 인덱스값
    
    ★at과 iat은 단일값만 변경 가능하다. 복수의 값은 변경 불가능

In [54]:
emp.at[0,'ename'] = 'ssmithss' #0번째 줄의 ename 변경해
emp.head(3)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2
0,7369,ssmithss,CLERK,7902.0,1980-12-17,800,9999,20,9600,0.0
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0

In [55]:
#update emp set job = 'sales' where deptno =10;
# 에러나는 문법 : Try using .loc[row_indexer,col_indexer] = value instead . loc등을 이용해서 써라.

emp[emp['deptno']==10]['job'] = 'sale10' # 안됨
emp['job'][emp['deptno']==10] = 'sale10'  #되긴하는데 쓰지말기
emp.head(3)

C:\Users\ASIAE\AppData\Local\Temp\ipykernel_14100\297044691.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  emp[emp['deptno']==10]['job'] = 'sale10' # 안됨
C:\Users\ASIAE\AppData\Local\Temp\ipykernel_14100\297044691.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  emp['job'][emp['deptno']==10] = 'sale10'  #되긴하는데 쓰지말기

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2
0,7369,ssmithss,CLERK,7902.0,1980-12-17,800,9999,20,9600,0.0
1,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0

> emp.iat[0,1] = 'kkk' / 단일값이라서 변경 가능  
> emp.iat[0:2,1] = 'ddd' / 복수값이라서 변경 불가능

## 여러값 변경 가능 loc, iloc이용

In [56]:
emp.iloc[0:2,1] = "OOO"
emp.head(3)

   empno ename       job     mgr   hiredate   sal  comm  deptno   asal  comm2
0   7369   OOO     CLERK  7902.0 1980-12-17   800  9999      20   9600    0.0
1   7499   OOO  SALESMAN  7698.0 1981-02-20  1600  9999      30  19200  300.0
2   7521  WARD  SALESMAN  7698.0 1981-02-22  1250  9999      30  15000  500.0

## 조건부 수정

> * np.where(조건절, 참값, 거짓값) -- decode(deptno, 10, '십', '그 외')  
    -np.where(df['deptno']==10,'십','그 외')  
    
> * df[컬럼1].where(조건문, 거짓값)  
    -df['deptno'].where(df['deptno']==10, '그 외')

In [57]:
np.where(emp['deptno']==10,'십','그 외')

array(['그 외', '그 외', '그 외', '그 외', '그 외', '그 외', '십', '그 외', '십', '그 외',
       '그 외', '그 외', '그 외', '십'], dtype='<U3')

In [58]:
emp['dept_str'] = np.where(emp['deptno']==10,'십','그 외')

>update emp set job = 'sales10' where deptno = 10;

In [59]:
emp['job2'] = np.where(emp['deptno']==10,'sales10',emp['job']) #맞으면 그대로 컬럼값을 써야되니까 job을 쓴다. 새로운 컬럼 생성
emp[['job2','deptno']].sort_values(by=['deptno']).head(3)

       job2  deptno
6   sales10      10
8   sales10      10
13  sales10      10

* df[컬럼1].where(조건문, 거짓값)  
    -df['deptno'].where(df['deptno']==10, '그 외')

In [60]:
emp['job'].where(emp['deptno']!=10, 'sales1010')
emp.head(3)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2,dept_str,job2
0,7369,OOO,CLERK,7902.0,1980-12-17,800,9999,20,9600,0.0,그 외,CLERK
1,7499,OOO,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0,그 외,SALESMAN
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0,그 외,SALESMAN

In [61]:
#참일 경우(10이 아닌 경우) 직업 그대로 찍어라.

#참값.조건((만족하지 못하는), 거짓값)
emp['job3'] = emp['job'].where(emp['deptno']!=10, 'sales1010') #새 변수를 쓰면 새 컬럼 생성, 기존 컬럼은 업데이트 된 것.
emp.head(3)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2,dept_str,job2,job3
0,7369,OOO,CLERK,7902.0,1980-12-17,800,9999,20,9600,0.0,그 외,CLERK,CLERK
1,7499,OOO,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0,그 외,SALESMAN,SALESMAN
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0,그 외,SALESMAN,SALESMAN

# delete

* DML : delete from emp -- 데이터 삭제
* DDL : drop table emp -- 테이블 객체 삭제
----------------------------------------------------

* del emp             -- 데이터프레임객체 삭제
------------------------------------------------------

>* drop(**인덱스값**) / dropna()   -- 데이터 삭제  
* drop(컬럼명, axis = 1)   ---- 컬럼 삭제(세로 지우기)
* drop(인덱스값, axis = 0) ---- 행 삭제(가로 지우기) / 단일값이거나 [,]한 묶음으로 하거나

In [62]:
emp.drop(0).head(3)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2,dept_str,job2,job3
1,7499,OOO,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0,그 외,SALESMAN,SALESMAN
2,7521,WARD,SALESMAN,7698.0,1981-02-22,1250,9999,30,15000,500.0,그 외,SALESMAN,SALESMAN
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975,9999,20,35700,0.0,그 외,MANAGER,MANAGER

In [63]:
emp = emp.drop(0) #emp에 다시 넣어줘야 완전 삭제. 인덱스값 0 지웠는데 똑같이 0번 지우라고 재실행하면 이미 인덱스 0이 사라져서 에러가 난다.

In [64]:
emp = emp.drop(2,axis=0) #인덱스2 행을 삭제해라

In [65]:
emp.head(3)

,empno,ename,job,mgr,hiredate,sal,comm,deptno,asal,comm2,dept_str,job2,job3
1,7499,OOO,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0,그 외,SALESMAN,SALESMAN
3,7566,JONES,MANAGER,7839.0,1981-04-02,2975,9999,20,35700,0.0,그 외,MANAGER,MANAGER
4,7654,MARTIN,SALESMAN,7698.0,1981-09-28,1250,9999,30,15000,1400.0,그 외,SALESMAN,SALESMAN

In [66]:
emp = emp.drop('ename',axis = 1) #컬럼 ename 삭제
emp.head(3)

,empno,job,mgr,hiredate,sal,comm,deptno,asal,comm2,dept_str,job2,job3
1,7499,SALESMAN,7698.0,1981-02-20,1600,9999,30,19200,300.0,그 외,SALESMAN,SALESMAN
3,7566,MANAGER,7839.0,1981-04-02,2975,9999,20,35700,0.0,그 외,MANAGER,MANAGER
4,7654,SALESMAN,7698.0,1981-09-28,1250,9999,30,15000,1400.0,그 외,SALESMAN,SALESMAN

* 보통은 drop이 아닌 필요한 데이터를 출력해서 새 변수 프레임을 만들어 사용한다.

In [67]:
empcp = emp.copy()

In [1]:
del empcp #drop table 과 유사. 메모리에서 아예 삭제시켜버린다.

# empcp
# NameError: name 'empcp' is not defined
# pd.read_csv 로 다시 읽어들이기 전까지 쓸 수 없다.

NameError: name 'empcp' is not defined

**어제 배운 것 추가**

In [ ]:
df = pd.read_csv("./lec08_emp.csv", sep=",", parse_dates =['HIREDATE'])
#해당 컬럼을 날짜 형태로, 안하면(위에 지저분한 데이터값 보기) 나중에 또 변환해야한다.

df.head(13) # 데이터 과부하 막기 위해 항상 df(변수)만 불러오는게 아닌, head나 tail 습관화하자.

In [ ]:
dfcp = df.copy()
dfcp

In [ ]:
dfcp.isna().sum
dfcp